10/data/attachments/bf4b07b6fa4a06f9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_99e83886-a3a4-4e3b-8905-604275423e25</nif:username>
            <nif:friendToBeAdded>Andrew_small_Actions_81939_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>